Repository: hmmueller/PathDxf2GCode
Catalog: PathDxf2GCode/Messages.*.resx
Languages: de

# DxfHelper_CannotLoadFile_Path
source: Cannot load DXF file {0}
de: DXF-Datei {0} kann nicht geladen werden

# DxfHelper_ReadingFile__FileName
source: Reading {0}
de: Einlesen von {0}

# Options_Help
source: Call: PathDxf2GCode [options] [DXF files] Options: /h Help text /f 000 Milling speed in mm/min; required /z 000 Probing speed in mm/min; default is /f value /v 000 Maximum speed for sweeps in mm/min; required /s 000 Default sweep height in mm; required /c Check all paths in DXF file without writing GCode; if /c is not provided the DXF file must contain only one path layer /x zzz For all texts matching this regular expression, write assigned DXF objects; this is helpful for debugging parameter texts /d zzz Search path for references DXF files; can be specified multiple times; default is the location of the DXF file /n zzz Regular expression for path names; default value is ([0-9]{4})[.]([0-9]+)([A-Z]) /p zzz Regular expression for path patterns in file names; default is ([0-9]{4})(?:[.]([0-9]+))? /l zzz Language; default is operating system language
de: Aufruf: PathDxf2GCode [Optionen] [DXF-Dateien] Optionen: /h Hilfe-Anzeige /f 000 Fräsgeschwindigkeit in mm/min; Pflichtwert /z 000 Probe-Geschwindigkeit in mm/min; Standardwert ist /f-Wert /v 000 Maximalgeschwindigkeit für Leerfahrten in mm/min; Pflichtwert /s 000 Vorgabe für Leerfahrt-Höhe in mm; Pflichtwert /c Überprüfen aller Pfade in der DXF-Datei ohne G-Code-Ausgabe; wenn /c nicht angegeben wird, darf die DXF-Datei nur einen Pfad enthalten /x zzz Gibt für alle auf diesen regulären Ausdruck passenden Texte aus, welchem DXF-Objekt sie zugeordnet sind /d zzz Suchpfad für referenzierte DXF-Dateien; mehrfache /d-Angaben sind möglich; Standardwert ist das Verzeichnis der jeweiligen DXF-Datei /n zzz Reg.Ausdruck für Pfadbezeichnungen in DXF-Dateien; Standardwert ist ([0-9]{4})[.]([0-9]+)([A-Z]) /p zzz Reg.Ausdruck für Pfadmuster in Dateinamen; Standardwert ist ([0-9]{4})(?:[.]([0-9]+))? /l zzz Meldungssprache; Standard ist Windows-Einstellung

# Options_LessThan0_Name_Value
source: Option value {1} for {0} ist not >= 0
de: Wert {1} für Option {0} ist nicht >= 0

# Options_MissingF
source: /f missing or not > 0
de: /f nicht angegeben oder nicht größer als 0

# Options_MissingOptionAfter_Name
source: Missing value after option {0}
de: Fehlende Option nach {0}

# Options_MissingV
source: /v missing or not > 0
de: /v nicht angegeben oder nicht größer als 0

# Options_MissingS
source: /v missing or not > 0
de: /s nicht angegeben oder nicht größer als 0

# Options_MissingValue_Name
source: Missing value for option {0}
de: Fehlender Wert für Option {0}

# Options_NaN_Name_Value
source: Option value {1} for {0} is not a number
de: Wert {1} für Option {0} ist keine Zahl

# Options_NotSupported_Name
source: Option {0} not supported
de: Option {0} nicht unterstützt

# Params_BMustBeLessThanT_B_T
source: B={0} must not be larger than T={1}
de: B={0} darf nicht über T={1} liegen

# Params_CMustBeGtThan0_C
source: C={0} must be > 0
de: C={0} muss > 0 sein

# Params_UMustBeGtThan0_U
source: U={0} must be > 0
de: U={0} muss > 0 sein

# Params_PMustBeGtThan0_P
source: P={0} must be > 0
de: P={0} muss > 0 sein

# Params_DMustBeGtThanB_D_B
source: D={0} must be larger than B={1}
de: D={0} muss über B={1} liegen

# Params_DMustBeLessThanT_D_T
source: D={0} must not be larger than T={1}
de: D={0} darf nicht über T={1} liegen

# Params_FMustBeGtThan0_F
source: F={0} must be > 0
de: F={0} muss > 0 sein

# Params_IMustBeGtThan0_I
source: I={0} must be > 0
de: I={0} muss > 0 sein

# Params_MissingKey_Key
source: {0} value missing
de: {0}-Wert fehlt

# Params_OMustBeGtThan0_O
source: O={0} must be > 0
de: O={0} muss > 0 sein

# Params_SMustBeGtThanT_S_T
source: S={0} must be above T={1}
de: S={0} darf nicht unter oder nahe an T={1} liegen

# Params_AMustBeGtThan0_A
source: A={0} must be > 0
de: A={0} muss > 0 sein

# Params_WMustBeGtThan0_W
source: W={0} must be > 0
de: W={0} muss > 0 sein

# Params_TMustBeGtThan0_T
source: T={0} must be > 0
de: T={0} muss > 0 sein

# Params_UnsupportedKey_Name_Context
source: Unsupported {0} value; {1}
de: Nicht unterstützter {0}-Wert; {1}

# Params_VMustBeGtThan0_V
source: V={0} must be > 0
de: V={0} muss > 0 sein

# PathModel_PathDefinedTwice_Path_OtherFile
source: Path {0} has already been defined in {1}
de: Pfad {0} schon einmal definiert in {1}

# PathModel_CircleTooSmall_D_O
source: Diameter {0} is smaller than O={1}
de: Durchmesser {0} ist kleiner als O={1}

# PathModel_LineTypeNotSupported_LineType
source: Line type {0} not supported
de: Linienart {0} nicht unterstützt

# PathModel_LostEnd_End
source: End marker not near end of last traversed segment, but at {0} - add sweep
de: Ende-Markierung ist nicht am Ende des letztes erreichten Segments, sondern an Position {0}; Leerfahrt ergänzen

# PathModel_MissingEnd
source: End marker missing
de: Ende-Markierung fehlt

# PathModel_MissingKey_Key
source: {0} value missing
de: {0}-Wert fehlt

# PathModel_MissingParams_Path
source: No parameters found for path {0}; maybe path text center is not near enough to start marker
de: Keine Parameter für Pfad {0} gefunden; vielleicht ist Pfadtext nicht nahe genug an Start-Markierung

# PathModel_MissingPathDefinition_PathName
source: Path definition {0} not found; maybe start marker is not of line type PHANTOM(__ _ _ __)
de: Pfaddefinition {0} nicht gefunden; vielleicht hat Start-Markierung nicht Linientyp PHANTOM(__ _ _ __)

# PathModel_MissingStart
source: Start marker missing
de: Start-Markierung fehlt

# PathModel_NoMoreSegmentsFound_P
source: No more segments found after location {0}
de: Keine weiteren Segmente ab Punkt {0} gefunden

# PathModel_NoObjectFound_Text_Center_Diameter
source: No overlapping circle, arc or line found for '{0}'; maybe text center is not near enough to element (text circle: {1}, diam. {2}), or there is another overlapping text
de: Kein überlappender Kreis, Bogen und keine überlappende Linie für '{0}' gefunden; evtl. Textmitte nicht nahe genug (Textkreis: {1}, Durchm. {2}) oder überlappender weiterer Text

# PathModel_NotSpecialCircle_Diameter
source: Circle with line type PHANTOM (__ _ _ __) and diameter {0} has no special meaning
de: Kreis mit Linientyp PHANTOM (__ _ _ __) mit Durchmesser {0} hat keine spezielle Bedeutung

# PathModel_TextAssignment_Obj_Text
source: Object {0} has assigned text '{1}'
de: Objekt {0} hat zugeordneten Text '{1}'

# PathModel_TextLayerDifferentFromElementLayer_TextLayer_ElementLayer
source: Text layer name '{0}' different from element layer name '{1}'
de: Text-Layername '{0}' weicht von Element-Layername '{1}' ab

# PathModel_TextLayout_Text
source: Text {0} must be unrotated, with anchor at bottom left or top left
de: Text {0} muss unrotiert mit Anker unten links oder oben links sein

# PathModel_TwoEnds_E1_E2
source: Two end markers defined at {0} and {1}
de: Zwei Endpunkte definiert: {0} und {1}

# PathModel_TwoStarts_S1_S2
source: Two start markers defined at {0} and {1}
de: Zwei Anfangspunkte definiert: {0} und {1}

# PathModel_UnreachedSegments
source: {0} segments (e.g. this one here) not reached - maybe N value is missing
de: {0} Segmente (u.a. dieses hier) wurden nicht erreicht - evtl. fehlt N-Auszeichnung

# PathSegment_CallDepthGt9_Path
source: Nesting depth deeper than 9 levels at path {0}
de: Mehr als 9 verschachtelte Subpfade bei Einbettung von {0}

# PathSegment_DifferingM_Caller_Path_Called
source: M={0} at subpath {1} is different from M={2} in referenced path
de: M={0} an Subpfad {1} weicht von M={2} in referenziertem Modell ab

# PathSegment_DifferingO_Caller_Path_Called
source: O={0} at subpath {1} is different from O={2} in referenced path
de: O={0} an Subpfad {1} weicht von O={2} in referenziertem Modell ab

# PathSegment_DistanceDiffers_CallerDist_ModelName_CalledDist
source: Subpath size {0} is not equal to size {2} in referenced path {1}
de: Subpath-Länge {0} ist nicht gleich Länge {2} des referenzierten Subpfads {1}

# PathSegment_GtMissing
source: >... missing
de: >... fehlt

# PathSegment_InvalidPathName_Dir_Path
source: '{0}{1}' is not a valid path name
de: '{0}{1}' ist kein gültiger Pfadname

# PathSegment_PathNotFound_Name_Files
source: Could not find path {0} in file(s) {1}
de: Pfad {0} nicht in Datei(en) {1} gefunden

# Program_Checking_Path
source: Checking {0}
de: Überprüfung von {0}

# Program_CommandCount
source: Command count:
de: Befehlszahl:

# Program_DrillingLength
source: Drill length:
de: Bohrungen:

# Program_MillingLength
source: Milling length:
de: Fräslänge:

# Program_MoreThanOnePathLayer_File_Paths
source: DXF file {0} contains more than one path layer: {1}
de: DXF-Datei {0} enthält mehr als einen Pfad-LayerName: {1}

# Program_NoDxfFiles
source: No dxf files provided
de: Keine DXF-Dateien angegeben

# Program_NoErrorFreePathLayer_File
source: DXF file {0} contains no error-free path layer
de: DXF-Datei {0} enthält keinen Pfad-LayerName ohne Fehler

# Program_NoSegmentsFound
source: No segments found
de: Keine Segmente gefunden

# Program_SumLength
source: Sum:
de: Summe:

# Program_SweepLength
source: Sweeps:
de: Leerfahrten:

# Program_Writing_Path
source: Writing {0}
de: Schreiben von {0}

# Transformation2_DifferentDistances_FromS_FromE_FromD_ToS_ToE_ToD
source: Distance {0}...{1} = {2} ist not equal to distance {3}...{4} = {5}
de: Distanz {0}...{1} = {2} ist nicht gleich Distanz {3}...{4} = {5}

# PathSegment_DiameterGtA_Diameter_A
source: Diameter {0} of helix circle is larger than A={1}; possibly replace with arc path
de: Helix-Durchmesser {0} ist größer als A={1}; möglichst durch Bogenpfad ersetzen

# Variables_Error_Message
source: Error in variable definition: {0}
de: Fehler in Variablendefinition: {0}

# Variables_RangeHasMoreThanTwoNumbers_Variable_Range
source: Range for variable {0} must have format ###~### instead of '{1}'
de: Bereich für Variable {0} muss Format Zahl~Zahl (statt Wert '{1}') haben

# Variables_DefinitionNeitherListNorLettersNorRange_Variable_Definition
source: Definition for variable {0} must be comma-separated list, or letters group starting with ?, or range ...~... instead of '{1}'
de: Definition für Variable {0} muss kommaseparierte Liste oder Buchstabengruppe nach ? oder Bereich ...~... sein, statt '{1}'

# Variables_MissingValues_Variables
source: Missing values for variables {0}
de: Fehlende Werte für Variablen

# Variables_MissingDefinitions_Variables
source: Missing definitions for variables {0}
de: Fehlende Definitionen für Variablen {0}

# Variables_ValueDoesNotMatchDefinition_Value_Definition_Variable
source: Value '{0}' of variable {2} does not match definition '{1}'
de: Wert '{0}' der Variablen {2} passt nicht zu Definition '{1}'

# Variables_RangeFormatError_Variable_Message
source: Wrong number format in range for variable {0} ({1})
de: Falsches Zahlenformat bei Bereich für Variable {0} ({1})

# Params_DuplicateParametersFound_Text_Duplicates
source: The parameter(s) {1} are specified more than once in '{0}'
de: Der oder die Parameter {1} kommen in '{0}' öfter als einmal vor

# Params_NCannotUseVariable_Text
source: N parameter '{0}' cannot use variable
de: Parameter N mit Wert '{0}' darf keine Variablen verwenden

# Params_OCannotUseVariable_Text
source: O parameter '{0}' cannot use variable
de: Parameter O mit Wert '{0}' darf keine Variablen verwenden
